# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, MobileNetV4ConvSmall, []],   # 4
   [-1, 1, SPPF, [1024, 5]],
  ]  # 5

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 3], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 9

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 2], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 13 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 9], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 16 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 5], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 19 (P5/32-large)

    [[13, 16, 19], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
